cmsis-svd/cmsis-svd/data/Microchip/ATSAMV70J.svd
            <register>
               <name>DFSR</name>
               <description>Debug Fault Status Register</description>
               <addressOffset>0x00000030</addressOffset>
               <size>32</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>HALTED</name>
                     <description>debug event generated by</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>HALTEDSelect</name>
                        <enumeratedValue>
                           <name>VALUE_0</name>
                           <description>No active halt request debug event</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VALUE_1</name>
                           <description>Halt request debug event active</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BKPT</name>
                     <description>debug event generated by BKPT instruction execution or a breakpoint match in FPB</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>BKPTSelect</name>
                        <enumeratedValue>
                           <name>VALUE_0</name>
                           <description>No current breakpoint debug event</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VALUE_1</name>
                           <description>At least one current breakpoint debug event</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DWTTRAP</name>
                     <description>debug event generated by the DWT</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DWTTRAPSelect</name>
                        <enumeratedValue>
                           <name>VALUE_0</name>
                           <description>No current debug events generated by the DWT</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VALUE_1</name>
                           <description>At least one current debug event generated by the DWT</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VCATCH</name>
                     <description>triggering of a Vector catch</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>VCATCHSelect</name>
                        <enumeratedValue>
                           <name>VALUE_0</name>
                           <description>No Vector catch triggered</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VALUE_1</name>
                           <description>Vector catch triggered</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EXTERNAL</name>
                     <description>debug event generated because of the assertion of an external debug request</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>EXTERNALSelect</name>
                        <enumeratedValue>
                           <name>VALUE_0</name>
                           <description>No EDBGRQ debug event</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VALUE_1</name>
                           <description>EDBGRQ debug event</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>MMFAR</name>
               <description>MemManage Fault Address Register</description>
               <addressOffset>0x00000034</addressOffset>
               <size>32</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>ADDRESS</name>
                     <description>Data address for an MPU fault</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BFAR</name>
               <description>BusFault Address Register</description>
               <addressOffset>0x00000038</addressOffset>
               <size>32</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>ADDRESS</name>
                     <description>Data address for a precise bus fault</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AFSR</name>
               <description>Auxiliary Fault Status Register</description>
               <addressOffset>0x0000003C</addressOffset>
               <size>32</size>
               <resetValue>0</resetValue>
            </register>
            <register>
               <name>CLIDR</name>
               <description>Cache Level ID Register</description>
               <addressOffset>0x00000078</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x09000003</resetValue>
               <fields>
                  <field>
                     <name>LoC</name>
                     <description>Level of Coherency</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>LoCSelect</name>
                        <enumeratedValue>
                           <name>LEVEL_1</name>
                           <description>if neither instruction nor data cache is implemented</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LEVEL_2</name>
                           <description>if either cache is implemented</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LoU</name>
                     <description>Level of Unification</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>LoUSelect</name>
                        <enumeratedValue>
                           <name>LEVEL_1</name>
                           <description>if neither instruction nor data cache is implemented</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LEVEL_2</name>
                           <description>if either cache is implemented</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTR</name>
               <description>Cache Type Register</description>
               <addressOffset>0x0000007c</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x8303C003</resetValue>
               <fields>
                  <field>
                     <name>IMINLINE</name>
                     <description>Smallest cache line of all the instruction caches under the control of the processor</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DMINLINE</name>
                     <description>Smallest cache line of all the data and unified caches under the core control</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>ERG</name>
                     <description>Exclusives Reservation Granule</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CWG</name>
                     <description>Cache Writeback Granule</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>FORMAT</name>
                     <description>Register format</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CCSIDR</name>
               <description>Cache Size ID Register</description>
               <addressOffset>0x00000080</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>LineSize</name>
                     <description>number of words in each cache line</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>Associativity</name>
                     <description>number of ways</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>NumSets</name>
                     <description>number of sets</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>WA</name>
                     <description>Write allocation support</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RA</name>
                     <description>Read allocation support</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WB</name>
                     <description>Write-Back support</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WT</name>
                     <description>Write-Through support</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CSSELR</name>
               <description>Cache Size Selection Register</description>
               <addressOffset>0x00000084</addressOffset>
               <size>32</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>IND</name>
                     <description>selection of instruction or data cache</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>INDSelect</name>
                        <enumeratedValue>
                           <name>DATA</name>
                           <description>Data cache</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INSTRUCTION</name>
                           <description>Instruction cache</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LEVEL</name>
                     <description>cache level selected</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CPACR</name>
               <description>Coprocessor Access Control Register</description>
               <addressOffset>0x00000088</addressOffset>
               <size>32</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>CP10</name>
                     <description>Access privileges for coprocessor 10.</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>CP11</name>
                     <description>Access privileges for coprocessor 11.</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STIR</name>
               <description>Software Trigger Interrupt Register</description>
               <addressOffset>0x00000200</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>INTID</name>
                     <description>Interrupt ID of the interrupt to trigger, in the range 0-239. For example, a value of 0x03 specifies interrupt IRQ3.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MVFR0</name>
               <description>Media and VFP Feature Register 0</description>
               <addressOffset>0x00000240</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x10110021</resetValue>
            </register>
            <register>
               <name>MVFR1</name>
               <description>Media and VFP Feature Register 1</description>
               <addressOffset>0x00000244</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x10110021</resetValue>
            </register>
            <register>
               <name>MVFR2</name>
               <description>Media and VFP Feature Register 2</description>
               <addressOffset>0x00000248</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x10110021</resetValue>
            </register>
